# Drawing Conclusions Quiz
Use the space below to explore `store_data.csv` to answer the quiz questions below.

In [1]:
# imports and load data
import pandas as pd
df = pd.read_csv('store_data.csv')
df.head()

         week  storeA  storeB  storeC  storeD  storeE
0  2014-05-04    2643    8257    3893    6231    1294
1  2014-05-11    6444    5736    5634    7092    2907
2  2014-05-18    9646    2552    4253    5447    4736
3  2014-05-25    5960   10740    8264    6063     949
4  2014-06-01    7412    7374    3208    3985    3023

In [2]:
# explore data
df.describe()

             storeA        storeB       storeC       storeD       storeE
count    200.000000    200.000000   200.000000   200.000000   200.000000
mean    5865.480000   6756.710000  4942.105000  5431.405000  2580.025000
std     2958.230318   3601.339489  1325.407768  1183.111323  1725.651381
min      137.000000     14.000000   927.000000  2276.000000    39.000000
25%     3812.250000   3884.500000  4053.500000  4717.000000  1235.000000
50%     5713.500000   6771.000000  4962.500000  5382.000000  2522.000000
75%     7662.250000   9350.500000  5801.750000  6243.750000  3574.250000
max    14403.000000  15841.000000  8293.000000  8190.000000  7553.000000

In [3]:
# total sales for the last month
total_sales = df[df['week'] == df['week'].max()]
total_sales

           week  storeA  storeB  storeC  storeD  storeE
199  2018-02-25    7560    6904    3569    5045    2585

**Store A** highest total sales for the final month of data.

In [4]:
# average sales
df.mean()

storeA    5865.480
storeB    6756.710
storeC    4942.105
storeD    5431.405
storeE    2580.025
dtype: float64

**Store B** makes the most sales on average.

In [5]:
# sales on march 13, 2016
sales = df[df['week'] == '2016-03-13']
sales

          week  storeA  storeB  storeC  storeD  storeE
97  2016-03-13    2054    1390    5112    5513    2536

**Store D** sells the most during the week of March 13th, 2016.

In [6]:
# worst week for store C
df[df['storeC'] == df['storeC'].min()].week

9    2014-07-06
Name: week, dtype: object

**Store C** make its worst sales on **July 06th, 2014**.

In [7]:
# total sales during most recent 3 month period
sales_three_months = df.sort_values(by='week', ascending=False).head(3)
sales_three_months.sum(axis=0)

week      2018-02-252018-02-182018-02-11
storeA                             20274
storeB                             18092
storeC                             12260
storeD                             16827
storeE                              6329
dtype: object

In [8]:
# total sales during most recent 3 month period (use iloc)
sales_three_months.iloc[:, 1:].sum()

storeA    20274
storeB    18092
storeC    12260
storeD    16827
storeE     6329
dtype: int64